## Pandas - DataFrames Practice

In [1]:
# Import required libraries
import numpy as np
import pandas as pd

In [2]:
# Import the standard normal distribution function
from numpy.random import randn

In [3]:
# Create a Seed to replicate random numbers
np.random.seed(101)

### Create DataFrames

In [4]:
# Use pandas to generate a 5 x 4 table of random values
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [5]:
df.sum(axis=0)

W    1.719289
X    2.268822
Y    2.261436
Z    2.159356
dtype: float64

### How to make selections in DataFrames

In [6]:
# Select only the 'W' Column
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [7]:
type(df['W'])

pandas.core.series.Series

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

### How to create a New Column

In [10]:
df['new_col'] = df['W'] + df['Z']
df

          W         X         Y         Z   new_col
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

### How to remove columns

In [11]:
# Use the drop method to remove the new_col column with axis of 1 to specify header row
df.drop('new_col',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [12]:
# What is this...The column is still there
df

          W         X         Y         Z   new_col
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [13]:
# Use the inplace parameter set to True to permanently remove the column
df.drop('new_col',axis=1,inplace=True)

In [14]:
# Now that is what I am talking about...Don't try to trick me...
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### How to Drop Rows

In [15]:
# Dropping the E row
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [16]:
df.shape

(5, 4)

In [17]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### How to select Rows

In [18]:
# Use the location method based on the index LABEL
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [19]:
# Using the index based location method grab row d
df.iloc[3]

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

### Selecting a subset of a row and column

In [20]:
# Select the element at row B and column Y
df.loc['B','Y']

-0.84807698340363147

In [21]:
# Select multiple elements
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

## DataFrames - Part 2 Practice

In [22]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
# request conditional operation to return boolean values
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [24]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
# Filter the W column based on values greater than zero
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [26]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
# Grab all the rows in the dataframe where Z is less than zero
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [28]:
# Call commands on conditional dataframe
results_df = df[df['Z']>0]
results_df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
# Grab results off the results df
results_df['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [30]:
# Simplified version of the above code
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [31]:
# Grabbing Two columns
df[df['W']>0][['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
D -0.933237  0.955057
E  2.605967  0.683509

### Concept of Using Multiple Conditions

In [32]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
# Use the ampersand to use multiple conditions to filter
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

### Indexing - Reseting or setting to something else

In [34]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
# Use the method reset_index() to rest the index and move the current index to a new column
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [36]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### How to set an index

In [37]:
# Create new index from string; Use split method to split string off of blank space
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [38]:
# Assign new column the new index values
df['States'] = newind

In [39]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [40]:
# Set the index for dataframe
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## DataFrames - Part 3 Practice

In [41]:
# Begin by importing numpy and pandas
import numpy as np
import pandas as pd

In [48]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [49]:
my_list = [1,1,1,1,2,2,2,2,3,3,3,4,4,5,5,6,6,]

In [50]:
my_set = set(my_list)
np.array(my_set)

array({1, 2, 3, 4, 5, 6}, dtype=object)

In [51]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [52]:
pd.MultiIndex.from_tuples(hier_index)

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [56]:
# Create a Normally Distributed Dataframe with 6 rows and 2 columns
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1  1.025984 -0.156598
   2 -0.031579  0.649826
   3  2.154846 -0.610259
G2 1 -0.755325 -0.346419
   2  0.147027 -0.479448
   3  0.558769  1.024810

### How to call data from Index Hierarchy

In [62]:
df.loc['G1'].loc[1]

A    1.025984
B   -0.156598
Name: 1, dtype: float64

In [63]:
df.index.names

FrozenList([None, None])

In [64]:
# Provide names to the index and subindex
df.index.names = ['Groups', 'Num']
df.index.names

FrozenList(['Groups', 'Num'])

In [65]:
df

                   A         B
Groups Num
G1     1    1.025984 -0.156598
       2   -0.031579  0.649826
       3    2.154846 -0.610259
G2     1   -0.755325 -0.346419
       2    0.147027 -0.479448
       3    0.558769  1.024810

In [66]:
# Practice grabbing the second row second column data in index g2
df.loc['G2'].loc[2][1]

-0.47944803904109595

### How to use Cross Section

In [67]:
# Alternate way to select outside index
df.xs('G1')

            A         B
Num
1    1.025984 -0.156598
2   -0.031579  0.649826
3    2.154846 -0.610259

In [68]:
df.xs(1,level='Num')

               A         B
Groups
G1      1.025984 -0.156598
G2     -0.755325 -0.346419